# Палиндром
print("Палиндром")

s = input()

if s == s[::-1]:
    print("YES")
else:
    print("NO")


# Делаем срезы 1
print("Делаем срезы 2")

s = input()

if len(s) >= 3:
    print(len(s))  # Общее количество символов в строке
    print(3 * s)  # Исходную строку, повторённую 3 раза подряд
    print(s[0])  # Первый символ строки
    print(s[0:3])  # Первые три символа строки
    print(s[-3:])  # Последние три символа строки
    print(s[::-1])  # Строку в обратном порядке
    print(s[1:-1])  # Строку без первого и последнего символов
else:
    print("Меньше 3-х символов!")


# Делаем срезы 2
print("Делаем срезы 2")

s = input()

if len(s) >= 5:
    print(s[2])  # Третий символ строки
    print(s[-2:-1])  # Предпоследний символ строки
    print(s[0:5])  # Первые пять символов строки
    print(s[:-2])  # Всю строку, кроме последних двух символов
    print(s[::2])  # Все символы с чётными индексами
    print(s[1::2])  # Все символы с нечётными индексами
    print(s[::-1])  # Все символы в обратном порядке
    print(s[::-2])  # Символы строки через один в обратном порядке, начиная с последнего
else:
    print("Меньше 5-х символов!")
