# Курсы валют
print("Курсы валют")

date = input()  # Формат ДД-ММ-ГГГГ
e = float(input())
y = float(input())
text = f"На {date}: 1€ = {e}₽, 1¥ = {y}₽"
print(text)


# Сумма кубов vs Куб суммы
print("Сумма кубов vs Куб суммы")

a = int(input())
b = int(input())
text = f"Для чисел {a} и {b}:\n Сумма кубов: {a}**3 + {b}**3 = {a**3 + b**3}\n Куб суммы: ({a} + {b})**3 = {(a + b)**3}"
print(text)


# (Не) Активное похудение
print("(Не) Активное похудение")

d = int(input())  # номер дня — целое число от 1 до 60 включительно
w = float(input())  # текущий вес Гвидо — действительное число

if 1 <= d <= 60:
    t = 100 - d * 0.2  # Целевой вес
    text = f"#{d} ДЕНЬ: ТЕКУЩИЙ ВЕС = {w} кг, ЦЕЛЬ по ВЕСУ = {t} кг"
    if w <= t:
        print("Все идет по плану", "\n", text)
    else:
        print("Что-то пошло не так", "\n", text)
else:
    print("У Гвидо 60 дней!")
